In [61]:
# Clean the string data in the given Pandas Dataframe

In [62]:
# importing pandas as pd
import pandas as pd
  
# Create the dataframe
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':[' UMbreLla', '  maTress', 'BaDmintoN ', 'Shuttle'],
                   'Updated_Price':[1250, 1450, 1550, 400],
                   'Discount':[10, 8, 15, 10]})
  
# Print the dataframe
print(df)

        Date     Product  Updated_Price  Discount
0  10/2/2011    UMbreLla           1250        10
1  11/2/2011     maTress           1450         8
2  12/2/2011  BaDmintoN            1550        15
3  13/2/2011     Shuttle            400        10

In [67]:
df.shape # shape tell me the row n column

(4, 4)

In [68]:
df['Product'] = df['Product'].apply(lambda x: x.strip().capitalize())

In [69]:
df

        Date    Product  Updated_Price  Discount
0  10/2/2011   Umbrella           1250        10
1  11/2/2011    Matress           1450         8
2  12/2/2011  Badminton           1550        15
3  13/2/2011    Shuttle            400        10

In [70]:
df['product'] = df['Product'].apply(lambda x:x.strip().capitalize())

In [71]:
df

        Date    Product  Updated_Price  Discount    product
0  10/2/2011   Umbrella           1250        10   Umbrella
1  11/2/2011    Matress           1450         8    Matress
2  12/2/2011  Badminton           1550        15  Badminton
3  13/2/2011    Shuttle            400        10    Shuttle